Revit 2027 API
CompoundStructureLayer.DeckProfileId Property
 The ElementId of the structural deck profile - only for a layer whose function is StructuralDeck.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DeckProfileId { get; set; }
Public Property DeckProfileId As ElementId
	Get
	Set
public:
property ElementId^ DeckProfileId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member DeckProfileId : ElementId with get, set
Property Value
ElementId
 The default is InvalidElementId.
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace